app/controllers/blog_controller.rb

SELECT `items`.* FROM `items`  ORDER BY `items`.`id` DESC
SELECT `tags`.* FROM `tags`  ORDER BY `tags`.`id` DESC
---
  def index
    @items = Item.all.order(id: :desc)
    @tags = Tag.all.order(id: :desc)

SELECT  `items`.* FROM `items` WHERE `items`.`id` = NULL LIMIT 1
SELECT `tags`.* FROM `tags` INNER JOIN `items_tags` ON `items_tags`.`tag_id` = `tags`.`id` INNER JOIN `items` ON `items`.`id` = `items_tags`.`item_id` WHERE `items`.`id` = 8  ORDER BY `tags`.`id` DESC
---
  def post
    @item = Item.find(params[:id])
    @tags = Tag.joins(:items).merge(Item.where(:id => params[:id])).all.order(id: :desc)

SELECT  `items`.* FROM `items` INNER JOIN `items_tags` ON `items_tags`.`item_id` = `items`.`id` INNER JOIN `tags` ON `tags`.`id` = `items_tags`.`tag_id` WHERE `tags`.`id` = 11 LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM `items` INNER JOIN `items_tags` ON `items_tags`.`item_id` = `items`.`id` INNER JOIN `tags` ON `tags`.`id` = `items_tags`.`tag_id` WHERE `tags`.`id` = 11
SELECT `tags`.* FROM `tags`  ORDER BY `tags`.`id` DESC
---
  def tag
    @items = Item.joins(:tags).merge(Tag.where(:id => params[:id])).paginate(:page => params[:page], :per_page => 2)
    @tags = Tag.all.order(id: :desc)