app/controllers/items_controller.rb

  def index
    @items = Item.all.order(id: :desc)
---
SELECT `items`.* FROM `items`  ORDER BY `items`.`id` DESC

  def show
    @item = Item.find(params[:id])
---
SELECT  `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1

  def edit
    @item = Item.find(params[:id])
---
SELECT  `items`.* FROM `items` WHERE `items`.`id` = 2 LIMIT 1

  def create
    @item = Item.new(item_params)
    if @item.save
---
INSERT INTO `items` (`heading`, `body`, `image`, `created_at`, `updated_at`) VALUES ('ddddddddddddd', 'ddddddddddddd', 'DS.JPG', '2016-10-13 10:12:52', '2016-10-13 10:12:52')

  def update
    @item = Item.find(params[:id])
    if @item.update(item_params)
---
SELECT  `items`.* FROM `items` WHERE `items`.`id` = 2 LIMIT 1
UPDATE `items` SET `heading` = 'Лорем ипсум долор сит амет, сеа ат видит еффициенди, цум цу мунди лаудем, вел еа нибх ребум цетерос.', `body` = 'Лорем ипсум долор сит амет, сеа ат видит еффициенди, цум цу мунди лаудем, вел еа нибх ребум цетерос. Нам ад санцтус цоммуне аргументум.', `updated_at` = '2016-10-13 17:36:29' WHERE `items`.`id` = 2

  def destroy
    @item = Item.find(params[:id])
    @item.destroy
---
SELECT  `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
DELETE FROM `items` WHERE `items`.`id` = 1