app/controllers/items_controller.rb

SELECT `tags`.* FROM `tags` WHERE `tags`.`item_id` = 8
---
  def destroy
    respond_to do |format|
      @item = Item.find(params[:id])
      if @item.destroy
        @tags = Tag.all