app/controllers/tags_controller.rb

  def create
    @item = Item.find(params[:item_id])
    @checktag = Tag.where(name: params[:tag][:name]).first()

    if(@checktag)
      @itemtag_check = ItemsTag.where("item_id = ? AND tag_id = ?", @item.id, @checktag.id).first()
      unless(@itemtag_check)
        @itemtag = ItemsTag.new(item_id: @item.id, tag_id: @checktag.id)
        @itemtag.save()
---
SELECT  `items`.* FROM `items` WHERE `items`.`id` = 2 LIMIT 1
SELECT  `tags`.* FROM `tags` WHERE `tags`.`name` = 'ddd'  ORDER BY `tags`.`id` ASC LIMIT 1
SELECT  `items_tags`.* FROM `items_tags` WHERE (item_id = 2 AND tag_id = 2)  ORDER BY `items_tags`.`id` ASC LIMIT 1
INSERT INTO `items_tags` (`item_id`, `tag_id`) VALUES (1, 1)
INSERT INTO `tags` (`name`, `item_id`, `created_at`, `updated_at`) VALUES ('dsaasd', 2, '2016-10-12 14:47:55', '2016-10-12 14:47:55')

  def destroy

    @item = Item.find(params[:item_id])
    @itemtag = ItemsTag.where("item_id = ? AND tag_id = ?", params[:item_id], params[:id]).first()
    @itemtag.destroy
---
SELECT  `items`.* FROM `items` WHERE `items`.`id` = 2 LIMIT 1
SELECT  `items_tags`.* FROM `items_tags` WHERE (item_id = '1' AND tag_id = '2')  ORDER BY `items_tags`.`id` ASC LIMIT 1
SELECT  `tags`.* FROM `tags` WHERE `tags`.`item_id` = 2 AND `tags`.`id` = 1 LIMIT 1
DELETE FROM `items_tags` WHERE `items_tags`.`tag_id` = 2
DELETE FROM `tags` WHERE `tags`.`id` = 1